Autodesk.Revit.DB.IFC.IFCAggregate.Item(System.Int32)
Get the IFCData for this aggregate.
index:
The index.
Returns:
The IFCData.

Autodesk.Revit.DB.IFC.IFCAggregate.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.IFC.IFCAggregate.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.IFC.IFCAggregate.GetSDAIVariant(System.Int32)
Gets the data value in the specified aggregate element.
index:
The index.
Returns:
The data value.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.GetIFCAggregateIterator
Returns a IFCAggregateIterator that iterates through the collection.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.Delete
Delete the aggregate object from the IFCFile model.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.AddValueOfType(System.String)
Adds an ifc object with primitive type of aggregate's item type to the aggregate.
typeName:
The type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The aggregate is not valid.
Since:
2023

Autodesk.Revit.DB.IFC.IFCAggregate.AddAggregate
Creates a nested aggregate and adds it to the aggregate.
Returns:
The nested aggregate.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The aggregate is not valid.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.Add(Autodesk.Revit.DB.IFC.IFCData)
Adds an element to the aggregate.
ifcData:
The IFCData element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The aggregate is not valid.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCAggregate.Count
The number of the data values in the aggregate.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.default(System.Int32)
Get the IFCData for this aggregate.
index:
The index.
Returns:
The IFCData.

Autodesk.Revit.DB.IFC.IFCAggregate
A collection of IFC handles or attributes.
Since:
2013